// OOP篇
// 目录
	// 1 面向对象解决的问题
	// 2 对象与对象的关系
	// 3 对象与函数的关系
	// 4 new
	// 5 继承


// 在面向对象的领域里面，是没有函数的。
// 程序员的世界里有两大宗教，一个叫“面向对象教”，一个叫“函数式教”。
// 函数式教，教义里是存在对象的，但是面向对象教里是没有函数的。
// 面向对象教里的核心，是“类”。
// 如果一个东西返回了一个对象，那么这个东西就叫做类。
// 如果一个函数返回了一个对象，那么这个函数就叫做构造函数。
// 所以，其实二者是一个东西。



/*--------------------------------------------------------------------------------------------------------------*/
// 1 面向对象解决的问题
// 面向对象有三面红旗：封装（隐藏细节）、继承和多态。
	

	// 1.1 封装 ----------------------------------------------------------------------------------
	// 封装----隐藏细节----优雅的API----便于合作和传播（对别人）、缓解思维负担（对自己）
	// 但是这些函数也可以做到，这不是OOP教的专利。


	// 1.2 继承 -----------------------------------------------------------------------------------
	// 继承----同上----DialogWindow extend Window----Window有的我都有






